/* About screen blog label */
"About.blog" = "Blogi";

/* About screen footer */
"About.footer" = "Tämän on valmistanut globaali DigiWallet tiimi. Versio %1$@";

/* Privay Policy button label */
"About.privacy" = "Yksityisyyskäytäntö";

/* About screen reddit label */
"About.reddit" = "Reddit";

/* Terms of Use button label */
"About.terms" = "Käyttöehdot";

/* About screen title */
"About.title" = "Tietoa meistä";

/* About screen twitter label */
"About.twitter" = "Twitter";

/* Close modal button accessibility label */
"AccessibilityLabels.close" = "Sulje";

/* Support center accessibiliy label */
"AccessibilityLabels.faq" = "Tukikeskus";

/* Loading Wallet Message */
"Account.loadingMessage" = "Ladataan Lompakkoa";

/* Default wallet name */
"AccountHeader.defaultWalletName" = "Minun DigiWallet";

/* Error alert title */
"Alert.error" = "Virhe";

/* No internet alert message */
"Alert.noInternet" = "Verkkoyhteyttä ei löydy. Tarkista yhteytesi ja yritä uudelleen.";

/* Warning alert title */
"Alert.warning" = "Varoitus";

/* 'the addresses were copied'' Alert title */
"Alerts.copiedAddressesHeader" = "Osoitteet Kopioitu";

/* Addresses Copied Alert sub header */
"Alerts.copiedAddressesSubheader" = "Kaikki lompakon osoitteet ovat onnistuneesti kopioitu.";

/* Alert Header Label (the paper key was set) */
"Alerts.paperKeySet" = "Paperiavain Asetettu";

/* Alert Subheader label (playfully positive) */
"Alerts.paperKeySetSubheader" = "Mahtavaa!";

/* Alert Header label (the PIN was set) */
"Alerts.pinSet" = "PIN-koodi Asetettu";

/* Send failure alert header label (the send failed to happen) */
"Alerts.sendFailure" = "Lähetys epäonnistui";

/* Send success alert header label (confirmation that the send happened) */
"Alerts.sendSuccess" = "Lähetys Vahvistettu";

/* Send success alert subheader label (e.g. the money was sent) */
"Alerts.sendSuccessSubheader" = "Raha Lähetetty!";

/* JSON Serialization error message */
"ApiClient.jsonError" = "JSON Serialisointi Virhe";

/* Wallet not ready error message */
"ApiClient.notReady" = "Lompakko ei ole valmis";

/* API Token error message */
"ApiClient.tokenError" = "API merkkiä ei pystytty noutamaan";

/* header of balance */
"Balance.header" = "kokonais-\ntasapaino";

/* Send BCH view body. */
"BCH.body" = "Kirjoita tämän alle kohteen bitradio-osoite. Kaikki bitradiot jotka ovat lompakossasi haarautuman aikana (%1$@) tullaan lähettämään.";

/* Confirm sending <$5.00> to <address>? */
"BCH.confirmationMessage" = "Vahvista %1$@ lähetys osoitteeseen %2$@";

/* Confirmation alert title */
"BCH.confirmationTitle" = "Vahvistus";

/* Generic bch erorr message */
"BCH.genericError" = "Sinun tililläsi ei ole yhtään bitradioä, tai olet vastaanottanut bitradiojä haarautumisen jälkeen.";

/* Transaction ID copied message */
"BCH.hashCopiedMessage" = "Transaktio-ID kopioitu";

/* No address error message */
"BCH.noAddressError" = "Ole hyvä ja kirjoita osoite";

/* Attempted to scan unsupported qr code error message. */
"BCH.paymentProtocolError" = "Maksuprotokolla Pyynnöt eivät ole tuettuja bitradio transaktioille";

/* BCH successfully sent alert message */
"BCH.successMessage" = "bitradio lähetettiin onnistuneesti.";

/* Widthdraw BCH view title */
"BCH.title" = "Nosta bitradio";

/* Tx Hash button header */
"BCH.txHashHeader" = "bitradio Transaktio-ID";

/* Approve button label */
"BitID.approve" = "Hyväksy";

/* <sitename> is requesting authentication using your bitcoin wallet */
"BitID.authenticationRequest" = "%1$@ pyytää todennusta käyttäen sinun bitradio-lompakkoa";

/* Deny button label */
"BitID.deny" = "Kiellä";

/* BitID error alert title */
"BitID.error" = "Todentamisvirhe";

/* BitID error alert messaage (The payment service you are trying to use isn't working. Please contact them, as you may need to try again) */
"BitID.errorMessage" = "Ole hyvä ja tarkista palvelusta. Voi olla, että sinun tarvitsee yrittää uudelleen.";

/* BitID success alert title */
"BitID.success" = "Onnistuneesti Todennettu";

/* Cancel button label */
"Button.cancel" = "Peruuta";

/* Ignore button label */
"Button.ignore" = "Sivuta";

/* menu button */
"Button.menu" = "menu";

/* No button */
"Button.no" = "Ei";

/* OK button label */
"Button.ok" = "OK";

/* receive button */
"Button.receive" = "vastaanota";

/* send button */
"Button.send" = "lähetä";

/* Settings button label */
"Button.settings" = "Asetukset";

/* Settings button label */
"Button.submit" = "Lähetä";

/* Yes button */
"Button.yes" = "Kyllä";

/* Camera plugin instruction */
"CameraPlugin.centerInstruction" = "Keskitä ID:si laatikkoon";

/* Amount to Send: ($1.00) */
"Confirmation.amountLabel" = "Lähetettävä Määrä:";

/* Network Fee: ($1.00) */
"Confirmation.feeLabel" = "Verkon kulut:";

/* eg. Processing time: This transaction will take 10-30 minutes to process. */
"Confirmation.processingTime" = "Prosessointiaika: Tämä transaktio vie %1$@ minuuttia prosessoida.";

/* Label for "send" button on final confirmation screen */
"Confirmation.send" = "Lähetä";

/* Confirmation Screen title */
"Confirmation.title" = "Vahvistus";

/* To: (address) */
"Confirmation.to" = "Kenelle";

/* Total Cost: ($5.00) */
"Confirmation.totalLabel" = "Kokonaiskulu:";

/* Confirm paper phrase view label. */
"ConfirmPaperPhrase.label" = "Varmistaaksemme että kaikki on kirjoitettu oikein, ole hyvä ja kirjoita seuraavat sanat sinun paperiavaimestasi.";

/* Word label eg. Word #1, Word #2 */
"ConfirmPaperPhrase.word" = "Sana #%1$@";

/* Bitcoin denomination picker label */
"DefaultCurrency.bitcoinLabel" = "bitradio Näyttö Yksikkö";

/* Exchange rate label */
"DefaultCurrency.rateLabel" = "Vaihtokurssi";

/* Email unavailable alert title */
"ErrorMessages.emailUnavailableMessage" = "Tätä laitetta ei ole määritetty lähettämään sähköposteja iOS mail app:in avulla.";

/* Email unavailable alert title */
"ErrorMessages.emailUnavailableTitle" = "Sähköposti Ei ole saatavilla";

/* Messaging unavailable alert title */
"ErrorMessages.messagingUnavailableMessage" = "Tämä laite ei ole määritetty lähettämään viestejä.";

/* Messaging unavailable alert title */
"ErrorMessages.messagingUnavailableTitle" = "Viestitys Ei ole saatavilla";

/* You can customize your Face ID Spending Limit from the [FaceIdSettings.linkText gets added here as a button] */
"FaceIDSettings.customizeText" = "Voit muokata omaa Face ID käyttörajaa täältä %1$@";

/* Face Id screen label */
"FaceIDSettings.label" = "Käytä kasvojasi avataksesi DigiWallettisi ja lähetä rahaa määritettyyn rajaan asti.";

/* Link Text (see FaceIdSettings.customizeText) */
"FaceIDSettings.linkText" = "Linkki Teksti (katso TouchIdSettings.customizeText)";

/* Face id switch label. */
"FaceIDSettings.switchLabel" = "Aktivoi Face ID DigiWallettiisi";

/* Face ID settings view title */
"FaceIDSettings.title" = "Face ID";

/* Face ID unavailable alert message */
"FaceIDSettings.unavailableAlertMessage" = "Et ole määrittänyt Face ID:tä tälle laitteelle. Mene Asetukset->Face ID & Salasana asettaaksesi sen nyt.";

/* Face ID unavailable alert title */
"FaceIDSettings.unavailableAlertTitle" = "Face ID Ei ole määritetty";

/* Face Id spending limit screen title */
"FaceIDSpendingLimit.title" = "Face ID Käyttöraja";

/* Economy fee */
"FeeSelector.economy" = "Talous";

/* Fee Selector economly fee description */
"FeeSelector.economyLabel" = "Arvioitu Toimitus: 10+ minuuttia";

/* Warning message for economy fee */
"FeeSelector.economyWarning" = "Tämä valinta ei ole suositeltu aikarajoitteisiin transaktioihin.";

/* Regular fee */
"FeeSelector.regular" = "Tavallinen";

/* Fee Selector regular fee description */
"FeeSelector.regularLabel" = "Arvioitu Toimitus: 15-30 sekuntia";

/* Fee Selector title */
"FeeSelector.title" = "Prosessointiaika";

/* Checking private key balance progress view text */
"Import.checking" = "Tarkistetaan yksityisen avaimen saldo...";

/* Sweep private key confirmation message */
"Import.confirm" = "Lähetä %1$@ tästä yksityisestä avaimesta lompakkoosi?  bitradio-verkko tulee saamaan %2$@ suuruisen palkkion.";

/* Duplicate key error message */
"Import.Error.duplicate" = "Tämä yksityinen avain on jo lompakossasi.";

/* empty private key error message */
"Import.Error.empty" = "Tämä yksityinen avain on tyhjä.";

/* High fees error message */
"Import.Error.highFees" = "Transaktiomaksu tulisi olemaan enemmän kuin mitä tällä yksityisellä avaimella on saatavilla olevaa katetta.";

/* Not a valid private key error message */
"Import.Error.notValid" = "Tämä ei ole pätevä yksityinen avain";

/* Import signing error message */
"Import.Error.signing" = "Virhe kirjatessa transaktiota";

/* Import button label */
"Import.importButton" = "Tuonti";

/* Importing wallet progress view label */
"Import.importing" = "Tuodaan Lompakkoa";

/* Caption for graphics */
"Import.leftCaption" = "Lompakko joka tullaan tuomaan";

/* Import wallet intro screen message */
"Import.message" = "Lompakon tuonti siirtää kaikki rahat toisesta lompakostasi sinun DigiWallettiin käyttäen yhtä transaktiota.";

/* Enter password alert view title */
"Import.password" = "Tämä yksityinen avain on salasanasuojattu.";

/* password textfield placeholder */
"Import.passwordPlaceholder" = "\nsalasana";

/* Caption for graphics */
"Import.rightCaption" = "Sinun DigiWallet";

/* Scan Private key button label */
"Import.scan" = "Skannaa Yksityinen Avain";

/* Import wallet success alert title */
"Import.success" = "Onnistui";

/* Successfully imported wallet message body */
"Import.SuccessBody" = "Lompakko on onnistuneesti tuotu.";

/* Import Wallet screen title */
"Import.title" = "Tuo lompakko";

/* Unlocking Private key activity view message. */
"Import.unlockingActivity" = "Avaimen Lukituksen poisto";

/* Import wallet intro warning message */
"Import.warning" = "Lompakon tuonti ei sisällä transaktio-historiaa tai muita tietoja.";

/* Wrong password alert message */
"Import.wrongPassword" = "Väärä salasana, ole hyvä ja yritä uudelleen.";

/* Close app button */
"JailbreakWarnings.close" = "Sulje";

/* Ignore jailbreak warning button */
"JailbreakWarnings.ignore" = "Ohita";

/* Jailbreak warning message */
"JailbreakWarnings.messageWithBalance" = "LAITTEEN TURVALLISUUS VAARANNETTU\nMikä tahansa 'jailbreak' app voi päästä käsiksi DigiWalletin keychain tietoihin ja varastaa sinun bitradiot! Pyyhi tämä lompakko välittömästi ja palauta se turvalliselle laitteelle.";

/* Jailbreak warning message */
"JailbreakWarnings.messageWithoutBalance" = "LAITTEEN TURVALLISUUS VAARANNETTU\nMikä tahansa 'jailbreak' app voi päästä käsiksi DigiWalletin keychain tietoihin ja varastaa sinun bitradiot! Ole hyvä ja käytä DigiWallet:tia vain laitteeella joka ei ole jailbroken.";

/* Jailbreak warning title */
"JailbreakWarnings.title" = "VAROITUS";

/* Location services disabled error */
"LocationPlugin.disabled" = "Sijaintipalvelut ovat poissa käytöstä.";

/* No permissions for location services */
"LocationPlugin.notAuthorized" = "DigiWalletilla ei ole oikeutta päästä käsiksi sijaintipalveluihin.";

/* Wallet creation date prefix */
"ManageWallet.creationDatePrefix" = "Olet luonut lompakkosi %1$@";

/* Manage wallet description text */
"ManageWallet.description" = "Sinun lompakkosi nimi näkyy vain sinun tilisi transaktio-historiassasi, eivätkä muut voi nähdä sitä.";

/* Change Wallet name textfield label */
"ManageWallet.textFeildLabel" = "Lompakon nimi";

/* Manage wallet modal title */
"ManageWallet.title" = "Hallinnoi Lompakkoa";

/* Menu button title */
"MenuButton.lock" = "Lukitse lompakko";

/* Menu button title */
"MenuButton.security" = "Turvallisuuskeskus";

/* Menu button title */
"MenuButton.settings" = "Asetukset";

/* Menu button title */
"MenuButton.support" = "Tuki";

/* button label */
"MenuViewController.createButton" = "Luo uusi lompakko";

/* Menu modal title */
"MenuViewController.modalTitle" = "Menu";

/* button label */
"MenuViewController.recoverButton" = "Palauta lompakko";

/* Switch to automatic mode button label */
"NodeSelector.automaticButton" = "Vaihda Automaattiseen Tilaan";

/* Node is connected label */
"NodeSelector.connected" = "Yhdistetty";

/* Enter node ip address view body */
"NodeSelector.enterBody" = "Syötä Noden IP-osoite ja portti (valinnainen)";

/* Enter Node ip address view title */
"NodeSelector.enterTitle" = "Lisää Node";

/* Switch to manual mode button label */
"NodeSelector.manualButton" = "Vaihda Manuaaliseen Tilaan";

/* Node address label */
"NodeSelector.nodeLabel" = "Tämänhetkinen Ensisijainen Node";

/* Node is not connected label */
"NodeSelector.notConnected" = "Ei Yhdistetty";

/* Node status label */
"NodeSelector.statusLabel" = "Noden Yhteyden Tila";

/* Node Selector view title */
"NodeSelector.title" = "bitradio Nodet";

/* Bad Payment request alert title */
"PaymentProtocol.Errors.badPaymentRequest" = "Viallinen Maksupyyntö";

/* Error opening payment protocol file message */
"PaymentProtocol.Errors.corruptedDocument" = "Tukematon tai korruptoitunut asiakirja";

/* Missing certificate payment protocol error message */
"PaymentProtocol.Errors.missingCertificate" = "puuttuva sertifikaatti";

/* Request expired payment protocol error message */
"PaymentProtocol.Errors.requestExpired" = "pyyntö vanhentunut";

/* Payment too small alert title */
"PaymentProtocol.Errors.smallOutputError" = "Maksua ei voitu suorittaa";

/* Amount too small error message */
"PaymentProtocol.Errors.smallPayment" = "bitradio-maksut eivät voi olla vähemmän kuin %1$@.";

/* Output too small error message. */
"PaymentProtocol.Errors.smallTransaction" = "bitradio-transaktion ulostulot eivät voi olla vähemmän kuin $@.";

/* Unsupported signature type payment protocol error message */
"PaymentProtocol.Errors.unsupportedSignatureType" = "Tukematon allekirjoitustyyppi";

/* Untrusted certificate payment protocol error message */
"PaymentProtocol.Errors.untrustedCertificate" = "Luottamaton sertifikaatti";

/* Enable face ID prompt body */
"Prompts.FaceId.body" = "Napauta tähän aktivoidaksesi Face ID:n";

/* Enable face ID prompt title */
"Prompts.FaceId.title" = "Aktivoi Face ID";

/* No passcode set warning body */
"Prompts.NoPasscode.body" = "Laitteen salasana tarvitaan suojaamaan lompakkoasi. Mene asetuksiin ja ota salasana käyttöön.";

/* No Passcode set warning title */
"Prompts.NoPasscode.title" = "Kytke laitteen salasana päälle";

/* Warning about paper key. */
"Prompts.PaperKey.body" = "Sinun Paperiavain tulee säilyttää siltä varalta, että kadotat tai vaihdat puhelimesi. Napauta tähän jatkaaksesi.";

/* An action is required (You must do this action). */
"Prompts.PaperKey.title" = "Toiminto Vaaditaan";

/* Transaction rejected prompt body */
"Prompts.RecommendRescan.body" = "Lompakkosi saattaa olla pois synkronista. Tämän saa usein korjattua uudelleen skannaamalla blockchainin.";

/* Transaction rejected prompt title */
"Prompts.RecommendRescan.title" = "Transaktio Hylätty";

/* header of PinView */
"Prompts.SecurityCheck.header" = "TURVALLISUUS\nTARKISTAA";

/* Share data prompt body */
"Prompts.ShareData.body" = "Auta parantamaan DigiWalletia jakamalla anonyymiä tietoa kanssamme";

/* Share data prompt title */
"Prompts.ShareData.title" = "Jaa Anonyymiä Tietoa";

/* Enable touch ID prompt body */
"Prompts.TouchId.body" = "Napauta tähän aktivoidaksesi Touch ID:n";

/* Enable touch ID prompt title */
"Prompts.TouchId.title" = "Aktivoi Touch ID";

/* Upgrade PIN prompt body. */
"Prompts.UpgradePin.body" = "DigiWallet on päivittynyt käyttämään 6 numeroista PIN koodia. Napauta tähän päivittääksesi.";

/* Upgrade PIN prompt title. */
"Prompts.UpgradePin.title" = "Päivitä PIN";

/* Notifications will be added later but users can set their preferences now, which is why we specify "in the future". */
"PushNotifications.body" = "Ota käyttöön ilmoitukset, että voit vastaanottaa tulevaisuudessa erikoisviestejä DigiWalletista.";

/* Push notifications toggle switch label */
"PushNotifications.label" = "Push Ilmoitukset";

/* Push notifications are off label */
"PushNotifications.off" = "Poissa käytöstä";

/* Push notifications are on label */
"PushNotifications.on" = "Käytössä";

/* Push notifications settings view title label */
"PushNotifications.title" = "Ilmoitukset";

/* Address copied message. */
"Receive.copied" = "Kopioitu leikepöydälle.";

/* Share via email button label */
"Receive.emailButton" = "Sähköposti";

/* Request button label */
"Receive.request" = "Pyydä Summaa";

/* Share button label */
"Receive.share" = "Jaa";

/* Share via text message (SMS) */
"Receive.textButton" = "Tekstiviesti";

/* Receive modal title */
"Receive.title" = "Vastaanota";

/* Done button text */
"RecoverWallet.done" = "Valmis";

/* Recover wallet header */
"RecoverWallet.header" = "Palauta Lompakko";

/* Reset PIN with paper key: header */
"RecoverWallet.header_reset_pin" = "Nollaa PIN";

/* Enter paper key instruction */
"RecoverWallet.instruction" = "Kirjoita Paperiavain";

/* Recover wallet intro */
"RecoverWallet.intro" = "Palauta DigiWalletisi sinun paperiavaimella.";

/* Invalid paper key message */
"RecoverWallet.invalid" = "Syöttämäsi paperiavain ei ole kelvollinen. Ole hyvä ja tarkista jokainen sana ja yritä uudelleen.";

/* Previous button accessibility label */
"RecoverWallet.leftArrow" = "Vasen Nuoli";

/* Next button label */
"RecoverWallet.next" = "Seuraava";

/* Reset PIN with paper key: more information button. */
"RecoverWallet.reset_pin_more_info" = "Napauta tähän saadaksesi lisätietoa.";

/* Next button accessibility label */
"RecoverWallet.rightArrow" = "Oikea Nuoli";

/* Recover wallet sub-header */
"RecoverWallet.subheader" = "Kirjoita sen lompakon paperiavain jonka haluat palauttaa.";

/* Reset PIN with paper key: sub-header */
"RecoverWallet.subheader_reset_pin" = "Nollataksesi PIN-koodisi, kirjoita sanat paperiavaimestasi allaoleviin laatikoihin.";

/* No amount entered error message. */
"RequestAnAmount.noAmount" = "Ole hyvä ja aseta summa ensin.";

/* Request a specific amount of bitcoin */
"RequestAnAmount.title" = "Pyydä Summaa";

/* Alert action button label */
"ReScan.alertAction" = "Synkronoi";

/* Alert message body */
"ReScan.alertMessage" = "Rahan lähettäminen synkronoinnin aikana ei ole mahdollista.";

/* Alert message title */
"ReScan.alertTitle" = "Synkronoi Blockhainin kanssa?";

/* extimated time */
"ReScan.body1" = "20-45 minuuttia";

/* Syncing explanation */
"ReScan.body2" = "Jos transaktio näkyy valmiina bitradio verkossa, mutta ei sinun DigiWalletissa.";

/* Syncing explanation */
"ReScan.body3" = "Saat toistuvasti virheen, jossa sanotaan, että sinun transaktiosi on hylätty.";

/* Start Sync button label */
"ReScan.buttonTitle" = "Aloita Synkronointi";

/* Sync blockchain view footer */
"ReScan.footer" = "Rahan lähettäminen synkronoinnin aikana ei ole mahdollista.";

/* Sync Blockchain view header */
"ReScan.header" = "Synkronoi Blockchain";

/* Subheader label */
"ReScan.subheader1" = "Arvioitu aika";

/* Subheader label */
"ReScan.subheader2" = "Koska Synkronointi suoritetaan?";

/* Scan bitcoin address camera flash toggle */
"Scanner.flashButtonLabel" = "Kameran Salama";

/* Complete filter label */
"Search.complete" = "valmis";

/* Pending filter label */
"Search.pending" = "avoin";

/* Received filter label */
"Search.received" = "vastaanotettu";

/* Sent filter label */
"Search.sent" = "lähetetty";

/* Face ID button title */
"SecurityCenter.faceIdTitle" = "Face ID";

/* Security Center Info */
"SecurityCenter.info" = "Ota käyttöön kaikki turvaominaisuudet maksimoidaksesi suojan.";

/* Paper Key button description */
"SecurityCenter.paperKeyDescription" = "Ainoa tapa päästä käsiksi sinun bitradioihin jos kadotat tai vaihdat puhelinta.";

/* Paper Key button title */
"SecurityCenter.paperKeyTitle" = "Paperiavain";

/* PIN button description */
"SecurityCenter.pinDescription" = "Suojaa sinun bitradio-lompakkoasi luvattomilta käyttäjiltä.";

/* PIN button title */
"SecurityCenter.pinTitle" = "6-numeroinen PIN";

/* Security Center Title */
"SecurityCenter.title" = "Turvakeskus";

/* Touch ID button description */
"SecurityCenter.touchIdDescription" = "Poista helposti DigiWallet lukosta ja lähetä rahaa asetettuun rajaan asti.";

/* Touch ID button title */
"SecurityCenter.touchIdTitle" = "Touch ID";

/* Send money amount label */
"Send.amountLabel" = "Summa";

/* Balance: $4.00 */
"Send.balance" = "Saldo: %1$@";

/* Camera not allowed message */
"Send.cameraunavailableMessage" = "Mene asetuksiin ja salli kameran käyttö.";

/* Camera not allowed alert title */
"Send.cameraUnavailableTitle" = "DigiWalletin ei ole sallittu käyttää kameraa";

/* Warning when sending to self. */
"Send.containsAddress" = "Kohde on oma osoitteesi. Et voi lähettää itsellesi.";

/* Could not create transaction alert title */
"Send.creatTransactionError" = "Transaktiota ei voitu luoda.";

/* Description for sending money label */
"Send.descriptionLabel" = "Muistio";

/* Emtpy pasteboard error message */
"Send.emptyPasteboard" = "Pasteboard on tyhjä";

/* Network Fee: $0.01 */
"Send.fee" = "Verkkomaksu: %1$@";

/* Payee identity not certified alert title. */
"Send.identityNotCertified" = "Maksunsaajan henkilöllisyys ei ole todistettu.";

/* Invalid address alert message */
"Send.invalidAddressMessage" = "Kohde osoite ei ole kelvollinen bitradio-osoite.";

/* Invalid address on pasteboard message */
"Send.invalidAddressOnPasteboard" = "Pasteboard ei sisällä kelvollista bitradio-osoitetta.";

/* Invalid address alert title */
"Send.invalidAddressTitle" = "Osoite on kelvoton.";

/* Is rescanning error message */
"Send.isRescanning" = "Lähetys on poissa käytöstä täyden skannauksen aikana.";

/* Loading request activity view message */
"Send.loadingRequest" = "Ladataan Pyyntöä";

/* Empty address alert message */
"Send.noAddress" = "Ole hyvä ja kirjoita vastaanottajan osoite.";

/* Emtpy amount alert message */
"Send.noAmount" = "Ole hyvä ja anna summa joka lähetetään.";

/* Paste button label */
"Send.pasteLabel" = "Liitä";

/* Could not publish transaction alert title */
"Send.publishTransactionError" = "Transaktiota ei voitu julkaista.";

/* Could not load remote request error message */
"Send.remoteRequestError" = "Maksupyyntöä ei voitu ladata";

/* Scan button label */
"Send.scanLabel" = "Skannaa";

/* Send button label (the action, "press here to send") */
"Send.sendLabel" = "Lähetä";

/* Send screen title (as in "this is the screen for sending money") */
"Send.title" = "Lähetä";

/* Send money to label */
"Send.toLabel" = "Kenelle";

/* Adress already used alert message - first part */
"Send.UsedAddress.firstLine" = "bitradio-osoitteet ovat tarkoitettu  vain kertakäyttöä varten.";

/* Adress already used alert message - second part */
"Send.UsedAddress.secondLIne" = "Uudelleenkäyttäminen heikentää yksityisyyttä sinun ja myös vastaanottajan kohdalla ja voi johtaa tappioon jos vastaanottaja ei suoraan hallitse osoitetta.";

/* Adress already used alert title */
"Send.UsedAddress.title" = "Osoite on jo käytetty";

/* About label */
"Settings.about" = "Lisätiedot";

/* Advanced Settings title */
"Settings.advancedTitle" = "Kehittyneet Asetukset";

/* i.e. the currency which will be displayed */
"Settings.currency" = "Näytä Valuutta";

/* Join Early access label */
"Settings.earlyAccess" = "Liity Early Accessiin";

/* Are you enjoying bread alert message body */
"Settings.enjoying" = "Pidätkö DigiWalletin käytöstä?";

/* Face ID spending limit label */
"Settings.faceIdLimit" = "Face ID Käyttöraja";

/* Import wallet label */
"Settings.importTitle" = "Tuo Lompakko";

/* Manage settings section header */
"Settings.manage" = "Hallinta";

/* Notifications label */
"Settings.notifications" = "Ilmoitukset";

/* Leave review button label */
"Settings.review" = "Jätä meille Arvostelu";

/* Share anonymous data label */
"Settings.shareData" = "Jaa Anonyymiä Tietoa";

/* Sync blockchain label */
"Settings.sync" = "Synkronoi Blockchain";

/* Settings title */
"Settings.title" = "Asetukset";

/* Touch ID spending limit label */
"Settings.touchIdLimit" = "Touch ID Käyttöraja";

/* Wallet Settings section header */
"Settings.wallet" = "Lompakko";

/* Start or recover another wallet menu label. */
"Settings.wipe" = "Aloita/Palauta Toinen Lompakko";

/* Share data view body */
"ShareData.body" = "Auta parantamaan DigiWalletia jakamalla anonyymiä tietoa kanssamme. Tämä ei sisällä mitään taloustietoja. Me kunnioitamme sinun taloudellista yksityisyyttäsi.";

/* Share data header */
"ShareData.header" = "Jaa Tietoja?";

/* Share data switch label. */
"ShareData.toggleLabel" = "Jaa Anonyymiä Tietoa?";

/* button label */
"StartPaperPhrase.againButtonTitle" = "Kirjoita Paperiavain Uudelleen";

/* Paper key explanation text. */
"StartPaperPhrase.body" = "Sinun paperiavain on ainoa tapa palauttaa DigiWalletisi jos puhelimesi katoaa, varastetaan, menee rikki tai päivität sen.\n\nMe näytämme sinulle listan sanoja, jotka sinun tulee kirjoittaa paperille jonka pidät turvassa.";

/* button label */
"StartPaperPhrase.buttonTitle" = "Kirjoita Paperiavain Talteen";

/* Argument is date */
"StartPaperPhrase.date" = "Kirjoitit paperiavaimesi talteen viimeksi %1$@";

/* Start view message */
"StartViewController.message" = "Turvallisin ja nopein tapa käyttää bitradiojä.";

/* labels of syncView */
"SynchingView.blockHeightLabel" = "BLOCK KORKEUS";

"SynchingView.progressLabel" = "edistyminen";

/* Syncing view connectiong state header text */
"SyncingView.connecting" = "Yhdistetään";

/* Syncing view header text */
"SyncingView.header" = "Synkronoidaan";

/* Retry button label */
"SyncingView.retry" = "Yritä uudelleen";

/* Syncing view syncing state header text */
"SyncingView.syncing" = "Synkronoidaan";

/* 6 d (6 days) */
"TimeSince.days" = "%1$@ p";

/* 6 h (6 hours) */
"TimeSince.hours" = "%1$@ t";

/* 6 m (6 minutes) */
"TimeSince.minutes" = "%1$@ m";

/* 6 s (6 seconds) */
"TimeSince.seconds" = "%1$@ s";

/* You can customize your Touch ID Spending Limit from the [TouchIdSettings.linkText gets added here as a button] */
"TouchIdSettings.customizeText" = "Voit muuttaa Touch ID käyttörajaa nykyisestä %1$@.";

/* Touch Id screen label */
"TouchIdSettings.label" = "Käytä sormenjälkeä poistaaksesi DigiWalletisi lukosta ja lähetä rahaa asetettuun rajaan asti.";

/* Link Text (see TouchIdSettings.customizeText) */
"TouchIdSettings.linkText" = "Touch ID Käyttöraja Ruutu";

/* Spending Limit: b100,000 ($100) */
"TouchIdSettings.spendingLimit" = "Käyttöraja: %1$@ (%2$@)";

/* Touch id switch label. */
"TouchIdSettings.switchLabel" = "Ota Touch ID käyttöön DigiWalletissa";

/* Touch ID settings view title */
"TouchIdSettings.title" = "Touch ID";

/* Touch ID unavailable alert message */
"TouchIdSettings.unavailableAlertMessage" = "Sinun täytyy asettaa Touch ID tälle laitteelle. Mene Asetukset -> Touch ID & salasana asettaaksesi sen nyt.";

/* Touch ID unavailable alert title */
"TouchIdSettings.unavailableAlertTitle" = "Touch ID ei ole asetettu.";

/* Always require passcode option */
"TouchIdSpendingLimit" = "Vaadi aina salasana";

/* Touch ID spending limit screen body */
"TouchIdSpendingLimit.body" = "Sinua pyydetään antamaan 6-numeroinen PIN-koodisi ennen kuin voit lähettää yhtään transaktiota yli sinun määrittämän käyttörajasi, ja joka 48 tunti siitä, kun viimeksi annoit 6-numeroisen PIN-koodisi.";

/* Touch Id spending limit screen title */
"TouchIdSpendingLimit.title" = "Touch ID Käyttöraja";

/* Availability status text */
"Transaction.available" = "Käytettävissä oleva määrä";

/* Transaction complete label */
"Transaction.complete" = "Valmis";

/* eg. Ending balance: $50.00 */
"Transaction.ending" = "Loppusaldo: %1$@";

/* Exchange rate on date header */
"Transaction.exchangeOnDayReceived" = "Vaihtokurssi kun vastaanotettu:";

/* Exchange rate on date header */
"Transaction.exchangeOnDaySent" = "Vaihtokurssi kun lähetetetty:";

/* (b600 fee) */
"Transaction.fee" = "(%1$@ maksu)";

/* Invalid transaction */
"Transaction.invalid" = "KELVOTON";

/* Timestamp label for event that just happened */
"Transaction.justNow" = "juuri nyt";

/* Receive status text: 'In progress: 20%' */
"Transaction.receivedStatus" = "Eteneminen: %1$@";

/* Send status text: 'In progress: 20%' */
"Transaction.sendingStatus" = "Eteneminen: %1$@";

/* eg. Starting balance: $50.00 */
"Transaction.starting" = "Alkusaldo: %1$@";

/* Waiting to be confirmed string */
"Transaction.waiting" = "Odottaa vahvistusta. Jotkin kauppiaat vaativat vahvistuksen transaktion loppuun suorittamiseksi. Arvioitu aika: 1-2 minuuttia.";

/* e.g. I received money from an account. */
"TransactionDetails.account" = "Tili";

/* Amount section header */
"TransactionDetails.amountHeader" = "Summa";

/* Block height label */
"TransactionDetails.blockHeightLabel" = "Vahvistettu Block:ssa";

/* Memo section header */
"TransactionDetails.commentsHeader" = "Muistio";

/* Empty transaction list message. */
"TransactionDetails.emptyMessage" = "Transaktiosi ilmestyvät tänne.";

/* "Received [$5] at [which of my addresses]" => This is the "at [which of my addresses]" part. */
"TransactionDetails.from" = "- %1$@";

/* More button title */
"TransactionDetails.more" = "Lisää...";

/* Moved $5.00 (as in "I moved $5 to another location") */
"TransactionDetails.moved" = "Siirretty %1$@";

/* Moved $5.00 */
"TransactionDetails.movedAmountDescription" = "Siirretty <b>%1@</b>";

/* eg. Confirmed in Block: Not Confirmed */
"TransactionDetails.notConfirmedBlockHeightLabel" = "Ei Vahvistettu";

/* "Received [$5] at [which of my addresses]" => This is the "Received [$5]" part. */
"TransactionDetails.received" = "Vastaanotettu %1$@";

/* Received $5.00 */
"TransactionDetails.receivedAmountDescription" = "Vastaanotettu <b>%1@</b>";

/* "Sent [$5] to [address]" => This is the "Sent [$5]" part. */
"TransactionDetails.sent" = "Lähetetty %1$@";

/* Sent $5.00 */
"TransactionDetails.sentAmountDescription" = "Lähetetty <b>%1@</b>";

/* Status section header */
"TransactionDetails.statusHeader" = "Tila";

/* Transaction Details Title */
"TransactionDetails.title" = "Transaktion Tiedot";

/* "Sent [$5] to [address]" => This is the "to [address]" part. */
"TransactionDetails.to" = "- %1$@";

/* Transaction ID header */
"TransactionDetails.txHashHeader" = "bitradio Transaktion ID";

/* (this transaction was) Received at this address: */
"TransactionDirection.address" = "Vastaanotettu tässä Osoitteessa";

/* (this transaction was) Sent to this address: */
"TransactionDirection.to" = "Lähetetty tähän Osoitteeseen";

/* filter buttons for transactionView */
"TransactionView.all" = "kaikki";

"TransactionView.received" = "Saapuneet";

"TransactionView.sent" = "lähetetty";

/* Disabled until date */
"UnlockScreen.disabled" = "Poissa käytöstä tähän asti: %1$@";

/* My Address button title */
"UnlockScreen.myAddress" = "Minun Osoite";

/* Reset PIN with Paper Key button label. */
"UnlockScreen.resetPin" = "Nollaa PIN-koodi";

/* Scan button title */
"UnlockScreen.scan" = "Skannaa";

/* Unlock Screen sub-header */
"UnlockScreen.subheader" = "Kirjoita PIN-koodi";

/* TouchID prompt text */
"UnlockScreen.touchIdPrompt" = "Avaa DigiWallet lukituksesi.";

/* Unlock with TouchID accessibility label */
"UnlockScreen.touchIdText" = "Avaa lukosta Touch ID:llä";

/* Wallet unlocked message */
"UnlockScreen.unlocked" = "Lompakko avettu lukituksesta";

/* Update PIN caption text */
"UpdatePin.caption" = "Muista tämä PIN-koodi. Jos unohdat sen, et pysty pääsemään käsiksi sinun bitradioihisi.";

/* PIN creation info. */
"UpdatePin.createInstruction" = "Sinun PIN-koodia käytetään avaamaan lukitus sinun DigiWalletista ja lähettämään rahaa.";

/* Update PIN title */
"UpdatePin.createTitle" = "Aseta PIN-koodi";

/* Update PIN title */
"UpdatePin.createTitleConfirm" = "Kirjoita PIN-koodi uudelleen";

/* Enter current PIN instruction */
"UpdatePin.enterCurrent" = "Anna nykyinen PIN-koodi.";

/* Enter new PIN instruction */
"UpdatePin.enterNew" = "Anna uusi PIN-koodi.";

/* Re-Enter new PIN instruction */
"UpdatePin.reEnterNew" = "Kirjoita uusi PIN-koodi uudelleen.";

/* Update PIN failure error message. */
"UpdatePin.setPinError" = "Anteeksi, PIN-koodin päivitys epäonnistui.";

/* Update PIN failure alert view title */
"UpdatePin.setPinErrorTitle" = "Virhe PIN-koodin Päivittämisessä";

/* Update PIN title */
"UpdatePin.updateTitle" = "Päivitä PIN-koodi";

/* Authorize to copy wallet addresses alert message */
"URLHandling.addressaddressListAlertMessage" = "Kopioi lompakon osoite leikekirjaan?";

/* Authorize to copy wallet address PIN view prompt. */
"URLHandling.addressList" = "Salli lompakon osoitteen kopiointi leikekirjaan";

/* Authorize to copy wallet address alert title */
"URLHandling.addressListAlertTitle" = "Kopioi Lompakon Osoitteet";

/* Copy wallet addresses alert button label */
"URLHandling.copy" = "Kopioi";

/* Verify PIN for transaction view body */
"VerifyPin.authorize" = "Ole hyvä ja anna PIN-koodisi salliaksesi tämän transaktion.";

/* Verify PIN view body */
"VerifyPin.continueBody" = "Ole hyvä ja anna PIN-koodisi jatkaaksesi.";

/* Verify PIN view title */
"VerifyPin.title" = "PIN-koodi Vaaditaan";

/* Authorize transaction with touch id message */
"VerifyPin.touchIdMessage" = "Valtuuta tämä transaktio";

/* 'No wallet' warning for watch app */
"Watch.noWalletWarning" = "Avaa DigiWallet iPhone sovellus määrittääksesi lompakkosi.";

/* Dismiss button label */
"Webview.dismiss" = "Hylkää";

/* Webview loading error message */
"Webview.errorMessage" = "Virhe ladattaessa sisältöä. Ole hyvä ja yritä uudelleen.";

/* Updating webview message */
"Webview.updating" = "Päivitetään...";

/* Welcome screen text. (?) will be replaced with the help icon users should look for. */
"Welcome.body" = "bitradio iOS:lle on vaihtanut nimensä DigiWallet:ksi, nyt aivan uudella ulkoasulla ja muutamilla lisäominaisuuksia.\n\nJos tarvitset apua, pidä silmällä (?) useiden sivujen oikeassa ylänurkassa.";

/* Top title of welcome screen */
"Welcome.title" = "Tervetuloa DigiWalletiin!";

/* Wipe wallet alert message */
"WipeWallet.alertMessage" = "Oletko varma, että haluat tuhota tämän lompakon?";

/* Wipe wallet alert title */
"WipeWallet.alertTitle" = "Pyyhi Lompakko?";

/* Failed wipe wallet alert message */
"WipeWallet.failedMessage" = "Lompakon pyyhkiminen epäonnistui.";

/* Failed wipe wallet alert title */
"WipeWallet.failedTitle" = "Epäonnistui";

/* Enter phrase to wipe wallet instruction. */
"WipeWallet.instruction" = "Kirjoita tämän lompakon palautuslause pyyhkiäksesi sen ja aloita tai palauta jokin toinen. Sinun tämänhetkinen saldo säilyy tässä lauseessa.";

/* Start wipe wallet view message */
"WipeWallet.startMessage" = "Toisen lompakon aloittaminen tai palauttaminen sallii sinulle pääsyn jollekin toiselle DigiWalletille tällä laitteella.";

/* Start wipe wallet view warning */
"WipeWallet.startWarning" = "Et enää pysty pääsemään käsiksi sinun tämänhetkiseen DigiWalletiin tältä laitteelta. Saldo säilyy lauseessa.";

/* Wipe wallet navigation item title. */
"WipeWallet.title" = "Aloita tai Palauta Toinen Lompakko";

/* Wipe wallet button title */
"WipeWallet.wipe" = "Pyyhi";

/* Wiping activity message */
"WipeWallet.wiping" = "Pyyhitään...";

/* Paper key instructions. */
"WritePaperPhrase.instruction" = "Kirjoita ylös jokainen sana järjestyksessä ja säilytä turvallisessa paikassa.";

/* button label */
"WritePaperPhrase.next" = "Seuraava";

/* button label */
"WritePaperPhrase.previous" = "Edellinen";

/* 1 of 3 */
"WritePaperPhrase.step" = "%1$d / %2$d";

